# Brewfile (cross-platform)

# Core CLIs for both
brew "jq"
brew "yq"
brew "shfmt"
brew "tlrc"   # Rust tldr
brew "lsd"
brew "ripgrep"
brew "bat"
brew "fzf"
brew "zoxide"
brew "mise"
brew "direnv"
brew "gh"
brew "awscli"
brew "azure-cli"
brew "openfortivpn"
brew "topgrade"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "git-delta"

if OS.mac?
  brew "wget"

  cask "appcleaner"
  cask "caffeine"
  cask "chatgpt"
  cask "firefox"
  cask "font-jetbrains-mono-nerd-font"
  cask "google-chrome"
  cask "iterm2"
  cask "microsoft-edge"
  cask "microsoft-excel"
  cask "microsoft-outlook"
  cask "microsoft-powerpoint"
  cask "microsoft-teams"
  cask "notion"
  cask "obsidian"
  cask "orbstack"
  cask "pearcleaner"
  cask "postman"
  cask "sequel-ace"
  cask "sublime-text"
  cask "visual-studio-code"
  cask "windows-app"

  tap "deskflow/homebrew-tap"
  cask "deskflow"

  tap "th-ch/youtube-music"
  cask "youtube-music"

  brew "mas"
  mas "hide.me", id: 953040671
end

if OS.linux?
  # Keep here
end
