# brew bundle dump

brew "jq"
brew "tlrc" # Rust's "tldr"
brew "lsd" # alternative "ls"
brew "ripgrep" # alternative "grep" (rg)
brew "bat" # alternative "cat"

# dev toolchain
brew "mise"
brew "uv"

# Cloud CLIs
brew "gh"
brew "awscli"
brew "azure-cli"

# ─ Networking / Dev helpers
brew "wget"
brew "gnupg"
brew "openfortivpn"
brew "topgrade"

# ─ GUI Apps
cask "appcleaner"
cask "azure-data-studio"
cask "caffeine"
cask "chatgpt"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "sequel-ace"
cask "sublime-text"
cask "visual-studio-code"
cask "windows-app"
cask "zoom"

# ─ Music
tap "th-ch/youtube-music"
cask "youtube-music"

# ─ Mac App Store
brew "mas"
mas "hide.me", id: 953040671
