google-chrome
microsoft-edge
firefox
caffeine
microsoft-outlook
microsoft-teams
microsoft-excel
microsoft-powerpoint
windows-app # Previously Remote Desktop
phpstorm
postman
azure-data-studio
sequel-ace
diffmerge
visual-studio-code
iterm2
orbstack
notion
chatgpt
sublime-text
obsidian
